app/Controllers/Home.php

    public function index(): string
    {
        $usermodel = new UserModel;
        $user = $this->session->get("username");
        $gunungModel = new GunungModel();
        $pulau = $this->request->getGet('region');
        if ($pulau !== Null) {
            $gunungData = $gunungModel->where('pulau', $pulau)->findAll();
---
SELECT *
FROM `gunung`
WHERE `pulau` = '$1'