app/Models/GunungModel.php

SELECT *
FROM `gunung`
---
    public function getGunung()
    {
        // Mengambil data dari tabel users
        return $this->findAll(); // Mengambil semua data dari tabel

SELECT COUNT(*) AS `numrows` FROM `gunung`
---
    public function countTotalGunung()
    {
    return $this->countAll(); // Menghitung jumlah semua data di tabel gunung