app/Models/JalurModel.php

SELECT *
FROM `jalur`
---
    public function getAll()
    {
        return $this->findAll();

SELECT COUNT(*) AS `numrows` FROM `jalur`
---
    public function countTotalJalur()
    {
    return $this->countAll();

SELECT `id_jalur`
FROM `jalur`
WHERE `nama_jalur` = 'Jalur Jelek'
---
    public function getJalurName($name)
    {
        return $this->select('id_jalur')
                    ->where('nama_jalur', $name)
                    ->get()
                    ->getRow('id_jalur');