app/Models/MakananModel.php

SELECT *
FROM `makanan`
---
    public function getMakanan()
    {
        return $this->findAll();

SELECT *
FROM `makanan`
---
    public function getAll()
    {
        return $this->findAll();