app/Models/RequestDataModel.php

SELECT *
FROM `request_data`
---
    public function getAll()
    {
        // Mengambil data dari tabel users
        return $this->findAll(); // Mengambil semua data dari tabel

SELECT *
FROM `request_data`
WHERE `id_request` = '24'
---
    public function getRequest($id)
    {
        return $this->where('id_request', $id)->findAll();