app/Models/UserModel.php

    public function getAll()
    {
        return $this->findAll();
---
SELECT *
FROM `user`

    public function countTotalUser()
    {
    return $this->countAll(); // Menghitung jumlah semua data di tabel user
---
SELECT COUNT(*) AS `numrows` FROM `user`